#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mYWY1NzQxNS1mMTNiLTQ3MzAtYjlhMi00ZGZmYWQxOTM2ODc7b2JqZWN0SWQ9YTcyNTdlM2ItMWFiMC00M2QyLWFiMjQtMTExZWUzN2NhN2Q2O3N1YnNjcmlwdGlvbklkPWY5MGI0MTIxLTU3ZjEtNGRiNi1hZGU2LTNiMTJlYTkzMGE2Njt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto]
module.pubip.azurerm_public_ip.pubip: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cr.azurerm_container_registry.cr has been deleted
  - resource "azurerm_container_registry" "cr" {
      - admin_password                = (sensitive value) -> null
      - admin_username                = "crTwitterAuto" -> null
      - id                            = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto" -> null
      - login_server                  = "crtwitterauto.azurecr.io" -> null
      - name                          = "crTwitterAuto" -> null
        tags                          = {
            "Environment" = "Development"
        }
        # (15 unchanged attributes hidden)
    }

  # module.ni.azurerm_network_interface.ni has been deleted
  - resource "azurerm_network_interface" "ni" {
      - id                            = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto" -> null
        name                          = "ni-twitter-auto"
      - private_ip_address            = "10.0.1.4" -> null
        tags                          = {
            "Environment" = "Development"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.nisga.azurerm_network_interface_security_group_association.nisga has been deleted
  - resource "azurerm_network_interface_security_group_association" "nisga" {
      - id                        = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto" -> null
        # (2 unchanged attributes hidden)
    }

  # module.nsg.azurerm_network_security_group.nsg has been deleted
  - resource "azurerm_network_security_group" "nsg" {
      - id                  = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto" -> null
        name                = "nsg-twitter-auto"
        tags                = {
            "Environment" = "Development"
        }
        # (3 unchanged attributes hidden)
    }

  # module.pubip.azurerm_public_ip.pubip has been deleted
  - resource "azurerm_public_ip" "pubip" {
      - id                      = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto" -> null
      - ip_address              = "20.163.244.171" -> null
        name                    = "pubip-twitter-auto"
        tags                    = {
            "Environment" = "Development"
        }
        # (8 unchanged attributes hidden)
    }

  # module.rg.azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto" -> null
      - location = "eastus" -> null
      - name     = "rg-twitter-auto" -> null
        tags     = {
            "Environment" = "Development"
        }
    }

  # module.snet.azurerm_subnet.snet has been deleted
  - resource "azurerm_subnet" "snet" {
      - id                                             = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto" -> null
      - name                                           = "snet-twitter-auto" -> null
        # (7 unchanged attributes hidden)
    }

  # module.vnet.azurerm_virtual_network.vnet has been deleted
  - resource "azurerm_virtual_network" "vnet" {
      - id                      = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto" -> null
      - name                    = "vnet-twitter-auto" -> null
        tags                    = {
            "Environment" = "Development"
        }
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + custom_ca_trust_certificates_base64              = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = (sensitive value)
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "rg-twitter-auto"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "akscluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "aks-twitter-auto"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-twitter-auto"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "Development"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.cr.azurerm_container_registry.cr will be created
  + resource "azurerm_container_registry" "cr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "crTwitterAuto"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-twitter-auto"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "Environment" = "Development"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.hpa.kubernetes_horizontal_pod_autoscaler.hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "hpa"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = 10

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "hpa-deploy-deployment"
            }
        }
    }

  # module.hpa_deployment.kubernetes_deployment.hpa-deployment will be created
  + resource "kubernetes_deployment" "hpa-deployment" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "hpa-deploy-deployment"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "hpa-app"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "hpa-app"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "nginx:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "nginx"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + resources {
                          + limits   = {
                              + "cpu"    = "50m"
                              + "memory" = "100Mi"
                            }
                          + requests = {
                              + "cpu"    = "25m"
                              + "memory" = "50Mi"
                            }
                        }
                    }
                }
            }
        }
    }

  # module.hpa_service.kubernetes_service.hpa-service will be created
  + resource "kubernetes_service" "hpa-service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "hpa-deploy-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "hpa-app"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

  # module.load_generator.kubernetes_pod.load-generator will be created
  + resource "kubernetes_pod" "load-generator" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "load-generator"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + automount_service_account_token  = true
          + dns_policy                       = "ClusterFirst"
          + enable_service_links             = true
          + host_ipc                         = false
          + host_network                     = false
          + host_pid                         = false
          + hostname                         = (known after apply)
          + node_name                        = (known after apply)
          + restart_policy                   = "Never"
          + scheduler_name                   = (known after apply)
          + service_account_name             = (known after apply)
          + share_process_namespace          = false
          + termination_grace_period_seconds = 30

          + container {
              + args                       = [
                  + "while sleep 0.01; do wget -q -O- http://hpa-deploy-service; done",
                ]
              + command                    = [
                  + "/bin/sh",
                  + "-c",
                ]
              + image                      = "busybox:1.28"
              + image_pull_policy          = (known after apply)
              + name                       = "load-generator"
              + stdin                      = false
              + stdin_once                 = false
              + termination_message_path   = "/dev/termination-log"
              + termination_message_policy = (known after apply)
              + tty                        = false
            }
        }
    }

  # module.mongo_db.azurerm_cosmosdb_account.db will be created
  + resource "azurerm_cosmosdb_account" "db" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = false
      + enable_free_tier                             = false
      + enable_multiple_write_locations              = false
      + endpoint                                     = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "MongoDB"
      + local_authentication_disabled                = false
      + location                                     = "eastus"
      + mongo_server_version                         = (known after apply)
      + name                                         = (known after apply)
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "rg-twitter-auto"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + write_endpoints                              = (known after apply)

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 300
          + max_staleness_prefix    = 100000
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "westus"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }
    }

  # module.mongo_db.random_integer.ri will be created
  + resource "random_integer" "ri" {
      + id     = (known after apply)
      + max    = 99999
      + min    = 10000
      + result = (known after apply)
    }

  # module.ni.azurerm_network_interface.ni will be created
  + resource "azurerm_network_interface" "ni" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ni-twitter-auto"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-twitter-auto"
      + tags                          = {
          + "Environment" = "Development"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "Internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.nisga.azurerm_network_interface_security_group_association.nisga will be created
  + resource "azurerm_network_interface_security_group_association" "nisga" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.nsg.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-twitter-auto"
      + resource_group_name = "rg-twitter-auto"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment" = "Development"
        }
    }

  # module.pubip.azurerm_public_ip.pubip will be created
  + resource "azurerm_public_ip" "pubip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pubip-twitter-auto"
      + resource_group_name     = "rg-twitter-auto"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Development"
        }
    }

  # module.rg.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-twitter-auto"
      + tags     = {
          + "Environment" = "Development"
        }
    }

  # module.snet.azurerm_subnet.snet will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-twitter-auto"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-twitter-auto"
      + virtual_network_name                           = "vnet-twitter-auto"
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-twitter-auto"
      + resource_group_name = "rg-twitter-auto"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Development"
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cuatrosr, Action: `pull_request`, Workflow: `On Pull Request`*